# Brewfile for macOS dotfiles
# Run with: `brew bundle install --file=~/dotfiles/Brewfile`

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Core tools
brew "zsh"
brew "git"
brew "coreutils"
brew "grep"
brew "curl"
brew "wget"
brew "openssl"
brew "htop"
brew "tmux"
brew "vim"
brew "neovim"
brew "tree"
brew "bat"  # Better cat
brew "ripgrep"  # Better grep
brew "fd"  # Better find
brew "fzf"  # Fuzzy finder
brew "jq"  # JSON processor
brew "yq"  # YAML processor
brew "exa"  # Better ls
brew "z"  # Jump around
brew "diff-so-fancy"  # Better diff
brew "moreutils"  # Additional Unix utilities
brew "gnupg"  # GPG
brew "pinentry-mac"  # For GPG

# Development tools
brew "python"
brew "python@3.9"
brew "pyenv"  # Python version manager
brew "node"
brew "nvm"  # Node version manager
brew "go"
brew "ruby"
brew "rbenv"  # Ruby version manager
brew "rust"
brew "rustup-init"  # Rust installer

# Containers and cloud
brew "docker"
brew "docker-compose"
brew "kubernetes-cli"
brew "kubectx"  # Kubernetes context switcher
brew "helm"  # Kubernetes package manager
brew "awscli"  # AWS CLI
brew "azure-cli"  # Azure CLI
brew "terraform"  # Infrastructure as code
brew "gh"  # GitHub CLI

# Database tools
brew "postgresql"
brew "mysql"
brew "redis"

# Productivity
brew "tldr"  # Simplified man pages
brew "asdf"  # Version manager for multiple languages

# GUI Applications with Cask
cask "iterm2"  # Better terminal
cask "visual-studio-code"  # Code editor
cask "docker"  # Docker desktop
cask "alfred"  # Spotlight on steroids
cask "rectangle"  # Window manager
cask "postman"  # API development
cask "google-chrome"
cask "firefox"
cask "slack"
cask "zoom"
cask "1password"  # Password manager

# Fonts
cask "font-fira-code"  # Programming font
cask "font-jetbrains-mono"  # Programming font
cask "font-hack-nerd-font"  # For Powerlevel10k

# Mac App Store apps (requires mas-cli)
# Run: brew install mas
# mas "Amphetamine", id: 937984704  # Keep Mac awake
# mas "The Unarchiver", id: 425424353  # Unarchive everything
# mas "Keynote", id: 409183694  # Presentations
# mas "Numbers", id: 409203825  # Spreadsheets
# mas "Pages", id: 409201541  # Documents

# Uncomment the specific apps you want to install

# Customize this file to your needs by adding or removing packages
