# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "hashicorp/tap"
tap "aws/tap"
tap "github/gh"

# Shell utilities
brew "zsh"                   # Modern shell
brew "starship"              # Cross-shell prompt
brew "bat"                   # Cat clone with syntax highlighting
brew "exa"                   # Modern replacement for ls
brew "fd"                    # Simple, fast alternative to find
brew "ripgrep"               # Fast grep replacement
brew "fzf"                   # Fuzzy finder
brew "zoxide"                # Smarter cd command
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor
brew "htop"                  # Interactive process viewer
brew "tmux"                  # Terminal multiplexer
brew "tree"                  # Display directories as trees
brew "watch"                 # Execute a command periodically
brew "wget"                  # Internet file retriever
brew "curl"                  # Command line tool for transferring data
brew "rsync"                 # Fast incremental file transfer
brew "diff-so-fancy"         # Git diff output enhancer
brew "tldr"                  # Simplified man pages
brew "thefuck"               # Corrects previous console command
brew "direnv"                # Environment switcher
brew "shellcheck"            # Shell script static analysis
brew "ncdu"                  # Disk usage analyzer
brew "pv"                    # Monitor data through a pipe
brew "moreutils"             # Collection of tools
brew "gnu-sed"               # GNU version of sed
brew "gawk"                  # GNU awk
brew "coreutils"             # GNU core utilities

# Git and GitHub
brew "git"                   # Version control
brew "git-lfs"               # Git extension for large files
brew "gh"                    # GitHub CLI
brew "git-delta"             # Syntax-highlighting pager for git
brew "lazygit"               # Terminal UI for git
brew "pre-commit"            # Framework for managing git pre-commit hooks

# Development tools
brew "vim"                   # Text editor
brew "neovim"                # Hyperextensible Vim-based text editor
brew "asdf"                  # Extendable version manager
brew "ctags"                 # Generate tag files for source code
brew "make"                  # Utility for directing compilation
brew "cmake"                 # Cross-platform make
brew "gcc"                   # GNU compiler collection
brew "llvm"                  # Next-gen compiler infrastructure
brew "openssl"               # SSL/TLS cryptography library
brew "sqlite"                # Command-line interface for SQLite

# Python
brew "python"                # Interpreted, interactive, object-oriented programming language
brew "pyenv"                 # Python version management
brew "pipx"                  # Execute binaries from Python packages in isolated environments

# Ruby
brew "ruby"                  # Powerful, clean, object-oriented scripting language
brew "rbenv"                 # Ruby version manager
brew "ruby-build"            # Install various Ruby versions

# PHP
brew "php"                   # General-purpose scripting language
brew "composer"              # Dependency Manager for PHP
brew "wp-cli"                # Command-line interface for WordPress

# Node.js
brew "node"                  # Platform for building network applications
brew "yarn"                  # JavaScript package manager
brew "nvm"                   # Manage multiple Node.js versions

# Cloud & Infrastructure
brew "terraform"             # Tool for building, changing, and versioning infrastructure
brew "terragrunt"            # Thin wrapper for Terraform
brew "tflint"                # Terraform linter
brew "doctl"                 # DigitalOcean CLI
brew "awscli"                # Official Amazon AWS command-line interface
brew "aws-sam-cli"           # AWS SAM CLI
brew "azure-cli"             # Microsoft Azure CLI
brew "gcloud"                # Google Cloud SDK
brew "kubernetes-cli"        # Kubernetes command-line interface
brew "kubectx"               # Tool to switch between kubectl contexts
brew "kustomize"             # Customization of kubernetes YAML configurations
brew "helm"                  # Kubernetes package manager
brew "k9s"                   # Kubernetes CLI to manage clusters
brew "stern"                 # Multi pod and container log tailing for Kubernetes

# Docker
brew "docker"                # Pack, ship and run any application as a lightweight container
brew "docker-compose"        # Isolated development environments using Docker
brew "docker-buildx"         # Docker CLI plugin for extended build capabilities
brew "dive"                  # Tool for exploring each layer in a docker image

# AI Tools
brew "ollama"                # Run large language models locally

# Security
brew "gnupg"                 # GNU Pretty Good Privacy (PGP) package
brew "sops"                  # Editor of encrypted files
brew "vault"                 # Secures, stores, and tightly controls access to secrets
brew "age"                   # Simple, modern file encryption tool

# Networking
brew "nmap"                  # Port scanning utility
brew "mtr"                   # Traceroute and ping in a single tool
brew "netcat"                # Utility for managing network connections
brew "ipcalc"                # Calculate various network masks
brew "httpie"                # User-friendly cURL replacement
brew "speedtest-cli"         # Command-line interface for testing internet bandwidth

# Databases
brew "postgresql@14"         # Object-relational database system
brew "mysql"                 # Open source relational database management system
brew "redis"                 # Persistent key-value database

# Applications
cask "iterm2"                # Terminal emulator
cask "visual-studio-code"    # Code editor
cask "docker"                # App to build and share containerized applications
cask "postman"               # API client
cask "rectangle"             # Window management
cask "alfred"                # Application launcher and productivity software
cask "raycast"               # Control your tools with a few keystrokes
cask "1password"             # Password manager
cask "google-chrome"         # Web browser
cask "firefox"               # Web browser
cask "slack"                 # Team communication and collaboration software
cask "zoom"                  # Video communication and virtual meeting platform
cask "notion"                # App to write, plan, collaborate, and get organized
cask "obsidian"              # Knowledge base that works on local Markdown files
cask "spotify"               # Music streaming service
cask "discord"               # Voice and text chat software
cask "figma"                 # Collaborative interface design tool

# Fonts
cask "font-fira-code"                    # Monospaced font with programming ligatures
cask "font-jetbrains-mono"               # Typeface for developers
cask "font-hack-nerd-font"               # Developer targeted fonts with glyphs
cask "font-cascadia-code"                # Monospaced font by Microsoft
cask "font-source-code-pro"              # Monospaced font family for user interface
