# Brewfile - Homebrew packages
# Managed by chezmoi - DO NOT EDIT DIRECTLY

# Taps
tap "homebrew/services"
tap "hashicorp/tap"

# CLI Tools
brew "git"
brew "zsh"
brew "wget"
brew "curl"
brew "ripgrep"
brew "fzf"
brew "bat"
brew "eza"
brew "jq"
brew "yq"
brew "chezmoi"
brew "tmux"
brew "neovim"
brew "topgrade"
brew "dockutil"

{{ if not .minimal -}}
# Development Tools
brew "node"
brew "python"
brew "go"
brew "rust"
brew "shellcheck"
brew "pre-commit"
brew "asdf"
brew "gh"
brew "httpie"
brew "rbenv"
brew "ruby-build"
brew "hub"

# Cloud & DevOps Tools
brew "awscli"
brew "aws-iam-authenticator"
# Note: gcloud is not a valid Homebrew formula. Use google-cloud-sdk instead (see cask below)
{{ if and (hasKey . "cloud") (hasKey .cloud "oracle") .cloud.oracle -}}
brew "oci-cli"
{{ end -}}

# HashiCorp Tools
{{ if and (hasKey . "preferences") (hasKey .preferences "enable_hashicorp") .preferences.enable_hashicorp -}}
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/boundary"
brew "hashicorp/tap/waypoint"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "infracost"
{{ end -}}
{{ end -}}

{{ if eq .chezmoi.os "darwin" -}}
# macOS Applications
cask "visual-studio-code"
cask "iterm2"
cask "alfred"
cask "rectangle"
cask "1password"
{{ if not .minimal -}}
cask "docker"
cask "postman"
cask "slack"
cask "zoom"

# Cloud Provider GUIs
{{ if and (hasKey . "cloud") (hasKey .cloud "gcp") .cloud.gcp -}}
cask "google-cloud-sdk"
{{ end -}}

# Development Tools
cask "intellij-idea-ce"
cask "jetbrains-toolbox"
{{ if and (hasKey . "preferences") (hasKey .preferences "enable_ruby") .preferences.enable_ruby -}}
cask "rubymine"
{{ end -}}
{{ if and (hasKey . "preferences") (hasKey .preferences "enable_rust") .preferences.enable_rust -}}
cask "clion"
{{ end -}}
cask "fork" # Git client
{{ end -}}
{{ end -}}
